/*
 * Цикл for
 */

// for (ініціалізація; умова; пост - вираз){
//   // тіло цикла
// }

// for (let i = 0; i < 10; i += 1) {
//   console.log(i);
// }

// console.log('За межами циклу');

/*
 * Pre-increment та Post-increment
 */

// for (let i = 0; i < 10; i++) {
//   console.log(i);
// }

// let a = 10;
// const b = ++a;

// console.log('a:', a);
// console.log('b:',b);

/*
* Напиши скрипт, який підраховує загальну суму зарплат працівників.
 * Кількість працівників зберігається в змінній employees.
 * Зарплата кожного працівника це випадкове число від 500 до 5000
 * Записати суму в змінну totalSalary і вивести до консолі
 */



