/*
* Напиши скрипт підрахунку суми покупки зі знижкою залежно
 * від витраченої суми за весь час (партнерська програма).
 *
 * - Загальна сума витраченого зберігається в змінній totalSpent
 * - Сума поточного платежу зберігається у змінній payment
 * - Знижка зберігається в змінній discount
 *
 * - Якщо витрачено від [100 до 1000) – бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 – золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформлюємо замовлення на суму [сума] зі знижкою [знижка]%»
 */

