/*
 * Приведення до булю на прикладі Boolean(value)
 */

// console.log(Boolean());

/*
 * Логічне І (оператор &&)
 * - Запинається на брехні
 * - Повертає те, на чому запнулося або останній операнд
 */

// console.log(5 && 6);

// console.log(5 && 4 && 7 && 'mango');

/*
 * Логічне АБО  (оператор ||)
 * - Запинається на правді
 * - Повертає те, на чому запнулося або останній операнд
 */

// console.log(7 || 5 || 9 || 10);
// console.log(false || 5 || null || 0);

/*
 * Логічне НЕ (оператор !)
 * Робить інверсію правда > брехня та брехня > правда
 */

//  console.log(!0);
// console.log(!5);